server/app/controllers/activities_controller.rb

SELECT `activities`.* FROM `activities`
---
  def index
    user_id = params['user_id'].to_i
    longitude = params['longitude'].to_d
    latitude = params['latitude'].to_d
    @activities = Activity.all

SELECT `activities`.* FROM `activities` WHERE (user_id = '13')
SELECT `activities`.* FROM `activities` INNER JOIN `participates` ON `participates`.`activity_id` = `activities`.`id` WHERE (participates.user_id = '22')
SELECT `activities`.* FROM `activities` INNER JOIN `participates` ON `participates`.`activity_id` = `activities`.`id`
---
  def filter
    user_id = params['user']
    sponsor_id = params['sponsor']
    participant_id = params['participant']
    longitude = params['longitude'].to_d
    latitude = params['latitude'].to_d

    if sponsor_id != nil && sponsor_id != ''
      @activities = Activity.where(["user_id = ?", sponsor_id])
    elsif participant_id != nil && participant_id != ''
      @activities = Activity.joins(:participates).where(["participates.user_id = ?", participant_id])
    else
      @activities = Activity.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `activities` (`description`, `start_time`, `end_time`, `location`, `location_latitude`, `location_longitude`, `title`, `acceptable`, `user_id`, `created_at`, `updated_at`) VALUES ('测试', '2015-05-29 02:26:44', '2015-05-29 02:26:44', '测试地址', 0, 0, '测试', 0, 22, '2015-06-04 03:12:43', '2015-06-04 03:12:43')
---
  def create
    # @activity = Activity.new(activity_params)

    @activity = Activity.new(:description => params['description'],
                             :start_time => params['start_time'],
                             :end_time => params['end_time'],
                             :location => params['location'],
                             :location_latitude => params['latitude'],
                             :location_longitude => params['longitude'],
                             :title => params['title'],
                             :acceptable => FALSE
    )

    user = User.find(params[:user_id])
    @activity.user = user

    if @activity.save

SELECT  `activities`.* FROM `activities` WHERE `activities`.`id` = 0 LIMIT 1
---
    def set_activity
      @activity = Activity.find(params[:id])