server/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name = 'Ladarius' and password = '111111')
---
  def login
    username = params['username']
    password = params['password']
    @user = User.where(["name = ? and password = ?", username, password])